
{

    "intents": [
  
      {
  
        "tag": "greeting",
        "patterns": [
            "Hi",
            "Hey",
            "How are you",
            "Is anyone there?",
            "Hello",
            "Good day",
            ":wave:",
            ":grinning:",
            ":smiley:",
            ":blush:"
        ],
        "responses": [
            "Hey :grinning:",
            "Hello :wave:, thanks for visiting :wave:",
            "Hi there :smiley:, what can I do for you? :blush:",
            "Hi there :wave:, how can I help? :blush:"
        ]
    },
    {
        "tag": "goodbye",
        "patterns": [
            "Bye",
            "See you later",
            "Goodbye"
        ],
        "responses": [
            "See you later, thanks for visiting",
            "Have a nice day",
            "Bye! Come back again soon."
        ]
    },
    {
        "tag": "thanks",
        "patterns": [
            "Thanks",
            "Thank you",
            "That's helpful",
            "Thank's a lot!"
        ],
        "responses": [
            "Happy to help!",
            "Any time!",
            "My pleasure"
        ]
    },
  
      {
  
        "tag": "about_company",
  
        "patterns": [
  
          "Tell me about Smart Tunisian Technoparks",
  
          "What is STT?",
  
          "Can you provide information about the company?"
  
        ],
  
        "responses": [
  
          "Smart Tunisian Technoparks (STT) is a government initiative in Tunisia that promotes the development of technology and innovation. It aims to create an enabling environment for technology-based startups and companies. STT operates and manages several technoparks across the country, providing infrastructure, facilities, and support services to companies in IT, telecommunications, and other technology-driven sectors."
  
        ]
  
      },
  
      {
  
        "tag": "technoparks",
  
        "patterns": [
  
          "Which technoparks does STT manage?",
  
          "Tell me about the technoparks",
  
          "What are the locations of the technoparks?"
  
        ],
  
        "responses": [
  
          "Smart Tunisian Technoparks manages multiple technoparks in Tunisia. The main technoparks are:\n\n1. El Ghazala Technopark: Located in Tunis, it focuses on ICT and software development.\n2. Sfax Technopark: Located in Sfax, it specializes in technology-based industries.\n3. Borj Cedria Technopark: Situated near Tunis, it emphasizes research and development in various sectors.\n\nThese technoparks provide a supportive ecosystem for innovation, collaboration, and growth."
  
        ]
  
      },
  
      {
  
        "tag": "services",
  
        "patterns": [
  
          "What services does STT offer?",
  
          "Tell me about the services provided by the company",
  
          "What support does STT give to startups?"
  
        ],
  
        "responses": [
  
          "Smart Tunisian Technoparks offers a range of services to support startups and companies. These include:\n\n- Incubation programs to nurture early-stage startups.\n- Access to modern infrastructure, facilities, and shared workspaces.\n- Business support services, mentoring, and coaching.\n- Networking opportunities and access to a community of entrepreneurs and experts.\n- Assistance with funding and investment opportunities.\n\nSTT aims to provide an environment where businesses can thrive and contribute to the growth of Tunisia's technology sector."
  
        ]
  
      },
  
      {
  
        "tag": "contact",
  
        "patterns": [
  
          "How can I contact STT?",
  
          "What are the contact details?",
  
          "Can you provide me with the company's contact information?"
  
        ],
  
        "responses": [
  
          "You can contact Smart Tunisian Technoparks through the following channels:\n\nPhone: +123456789\nEmail: info@stt.com\nWebsite: https://www.smarttunisiantechparks.tn\n\nFeel free to reach out to us with any inquiries or for further assistance."
  
        ]
  
      },
  
      {
  
        "tag": "fallback",
  
        "patterns": [
  
          "I'm sorry, I don't understand",
  
          "Can you repeat that?",
  
          "I'm not sure I follow"
  
        ],
  
        "responses": [
  
          "I apologize for the confusion. If you have any specific questions or need assistance, please let me know."
  
        ]
  
      },
      {
        "tag": "sad",
        "patterns": [
            "i'm sad ",
            "I'm feeling down",
            "I'm feeling blue",
            "I'm not in a good mood",
            "you can play a game with me"
        ],
        "responses": [
            "Let's play a game! Click the Play Game button to get started.",
            "I'm sorry to hear that you're sad. Maybe I can lighten your mood with a funny story or joke?",
            "Let's play a game!",
            "Maybe I can lighten your mood with a funny story or joke?",
            "Let's play a game! Click the Play Game button to get started."
        ]
    }
  
    ]
  
  }